DataProcessors/Renault_ARM_Запчасти.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ARM_Запчасти</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуDialogys</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресDialogys</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалОбновленияСклада</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Корзина</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PCLБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PNCБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PNCСрочнаяБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PCL</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PNC</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PNCСрочная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаPCL</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаPNC</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаPNCСрочная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нераспределено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойПоставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Промоакция</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокЗаказов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нераспределено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойПоставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПоставки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>17</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбслуживания</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследнийКомментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказНаряд</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Промоакция</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаВЗаказе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупочная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупочнаяРассчитана</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_ИсторияВыгрузкиЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ИсторияВыгрузкиЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВОбработке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_Промоакции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_Промоакции</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_Промоакция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/Renault_ARM_Запчасти/Forms/ФормаСпискаУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	ВОбработке = ПолучитьСтатусВОбработке (ТекущаяСтрока.Ссылка);
	
	ФормаДокумента = ПолучитьФорму("ОбщаяФорма.Renault_ФормаДокументаЗаказПоставшику");
	ФормаДокумента.ДокументОбъект = ТекущаяСтрока.Ссылка.ПолучитьОБъект();
	Если ВОбработке Тогда
		ФормаДокумента.ТолькоПросмотр = Истина;
	Иначе
		ФормаДокумента.ЭлементыФормы.ТипЗаказа.ТолькоПросмотр = Истина;
		ФормаДокумента.УчитыватьКратность = Истина;
		ФормаДокумента.ЭлементыФормы.Контрагент.ТолькоПросмотр = Истина;
	КонецЕсли;
	ФормаДокумента.ЭлементыФормы.КоманднаяПанельТовары.Кнопки.Renault.Доступность = Истина;
	ФормаДокумента.Открыть();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатусВОбработке (Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ИсторияВыгрузкиЗаказов.ЗаказПоставщику
	|ИЗ
	|	РегистрСведений.Renault_ИсторияВыгрузкиЗаказов КАК Renault_ИсторияВыгрузкиЗаказов
	|ГДЕ
	|	Renault_ИсторияВыгрузкиЗаказов.ВОбработке
	|	И Renault_ИсторияВыгрузкиЗаказов.ЗаказПоставщику = &ЗаказПоставщику";
	Запрос.УстановитьПараметр("ЗаказПоставщику", Заявка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ИсправитьКоличество(Команда)
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		Отказ = ПроверитьДоступность(ТекущаяСтрока.Ссылка);
		Если Не Отказ и (ТекущаяСтрока.ОтправленВСАП или ТекущаяСтрока.ОтправленВРено) Тогда
			сПараметры = Новый Структура;
			сПараметры.Вставить("Заказ", ТекущаяСтрока.Ссылка);
			ОткрытьФорму("Обработка.Renault_ARM_Запчасти.Форма.ФормаРедКоличества",сПараметры);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьДоступность (Заявка)
	
	Если Заявка.ТипЗаказа = Справочники.ТипыЗаказов.ZMP2Срочный
		или Заявка.ТипЗаказа = Справочники.ТипыЗаказов.ZMP2Гарантийный Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ИсторияЗапросовИзменений(Команда)
	ОткрытьФорму("Обработка.Renault_ARM_Запчасти.Форма.ФормаСпискаИзменений");
КонецПроцедуры


&НаСервере
Процедура УстаноыитьДЦВЗаявке(ДЦСсылка, ДокСсылка)
	ДокОбъект = ДокСсылка.ПолучитьОбъект();
	ДокОбъект.ДилерскийЦентр = ДЦСсылка;
	ДокОбъект.Записать();
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАПОЛНЕНИЯ НА ОСНОВАНИИ

&НаСервере 
Процедура ВвестиЗаказНаСервере (Основание,ДокОбъект)
	
	Если ЗначениеЗаполнено(Основание.ЗаказПокупателя) Тогда 
		ДокОбъект = Основание.ЗаказПокупателя.ПолучитьОбъект();
		Возврат;
	КонецЕсли;
	
	ДокОбъект.ОбработкаРасчетСкидок = Обработки.РасчетСкидок.Создать();
	
	ДокОбъект.ХозОперация = Справочники.ХозОперации.ЗаказРезервированиеПокупателя;
	
	Настройка = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза;
	
	ДокОбъект.Контрагент                = Основание.Клиент.Контрагент;
	ДокОбъект.ДоговорВзаиморасчетов     = Основание.Клиент.ОсновнойДоговор;
	ДокОбъект.Организация               = Основание.ДилерскийЦентр.Организация;
	
	Если Основание.ДилерскийЦентр.ПодразделенияОрганизации.Количество() Тогда
		ДокОбъект.ПодразделениеКомпании = Основание.ДилерскийЦентр.ПодразделенияОрганизации[0].Подразделение;
	Иначе
		ДокОбъект.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
	КонецЕсли;
	
	ДокОбъект.ТипЦен                    = Настройка.ОптоваяЦена;
	ДокОбъект.СкладКомпании             = Настройка.ОсновнойСкладРеализации;
	ДокОбъект.ПроцентПредоплаты         = 0;
	
	Для Каждого СтрокаТЧЗаявки из Основание.Запчасти Цикл
		
		СтрокаТЧЗаказ = ДокОбъект.Товары.Добавить();
		
        СтрокаТЧЗаказ.Номенклатура        = СтрокаТЧЗаявки.Номенклатура;
        ДокОбъект.ОбработкаРеквизита("Товары.Номенклатура", СтрокаТЧЗаказ);
		
		СтрокаТЧЗаказ.Цена                = СтрокаТЧЗаявки.Цена;
        СтрокаТЧЗаказ.Количество          = СтрокаТЧЗаявки.Количество;
		ДокОбъект.ОбработкаРеквизита("Товары.Количество", СтрокаТЧЗаказ);
		
		СкидкаПромо = СтрокаТЧЗаявки.Промо.Значение;
		Если СтрокаТЧЗаявки.Скидка = "-" Тогда
			СкидкаБарем = СтрокаТЧЗаявки.Коэффициент;
		Иначе
			СкидкаБарем = -1 * СтрокаТЧЗаявки.Коэффициент;
		КонецЕсли;
		ОбщаяСкидка = СкидкаБарем + ((100 - СкидкаБарем) * СкидкаПромо / 100);
		СтрокаТЧЗаказ.СкидкаНаТовар       = Renault_ЗапчастиСкидки.Reanult_НайтиСоздатьТиповуюСкидку();
		СтрокаТЧЗаказ.ПроцентСкидкиСтроки = ОбщаяСкидка;
		
		ДокОбъект.ОбработкаРеквизита("Товары.ПроцентСкидкиСтроки", СтрокаТЧЗаказ);
		ДокОбъект.ОбработкаРеквизита("Товары.СуммаСкидкиСтроки",   СтрокаТЧЗаказ);
        ДокОбъект.ОбработкаРеквизита("Товары.СтавкаНДС",           СтрокаТЧЗаказ);
		
	КонецЦикла;
	
	ДокОбъект.Записать();
	
	ЗаявкаОбъект = Основание.ПолучитьОбъект();
	ЗаявкаОбъект.ЗаказПокупателя = ДокОбъект.Ссылка;
	ЗаявкаОбъект.Записать();
	
КонецПроцедуры

&НаСервере 
Функция ВвестиЗаменуНаСервере(Основание)
	
	ДокОбъект = Документы.ЗаменаВЗаказеПокупателя.СоздатьДокумент();
	ДокОбъект.ОбработкаРасчетСкидок = Обработки.РасчетСкидок.Создать();
	ДокОбъект.Заполнить(Основание);
	
	Возврат ДокОбъект;
	
КонецФункции

&НаСервере 
Функция ВвестиРеализациюНаСервере(Основание)
	
	ДокОбъект = Документы.РеализацияТоваров.СоздатьДокумент();
	ДокОбъект.ОбработкаРасчетСкидок = Обработки.РасчетСкидок.Создать();
	ДокОбъект.Заполнить(Основание);
	
	Возврат ДокОбъект;
	
КонецФункции


&НаКлиенте
Процедура СоздатьДокумент(Команда)
	Перем ТипЗаявки;
	Отказ = Истина;

	Если ВвестиЗначение(ТипЗаявки, "Выберите тип поставки",Новый ОписаниеТипов("СправочникСсылка.ТипыЗаказов")) Тогда
		ФормаДокумента = ПолучитьФорму("ОбщаяФорма.Renault_ФормаДокументаЗаказПоставшику");
		ФормаДокумента.Контрагент = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.ОсновнойПоставщик;
		ФормаДокумента.УчитыватьКратность = Истина;
		ФормаДокумента.ЭлементыФормы.Контрагент.ТолькоПросмотр = Истина;
		ФормаДокумента.ТипЗаказа = ТипЗаявки;
		ФормаДокумента.СрокПоставки = НачалоДня(ТекущаяДата())+ 86400;
		ФормаДокумента.ЭлементыФормы.ТипЗаказа.ТолькоПросмотр = Истина;
		ФормаДокумента.ЭлементыФормы.КоманднаяПанельТовары.Кнопки.Renault.Доступность = Истина;
		Если ТипЗаявки = Справочники.ТипыЗаказов.ZMP2Гарантийный или 
				ТипЗаявки = Справочники.ТипыЗаказов.ZMP2Срочный или 
					ТипЗаявки = Справочники.ТипыЗаказов.ZMP1PVI или 
						ТипЗаявки = Справочники.ТипыЗаказов.ZMP2Кодовые Тогда
			ФормаДокумента.ТипЦен = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.PNCЗакупСрочная;
		ИначеЕсли ТипЗаявки = Справочники.ТипыЗаказов.ZMP4Складской или 
						ТипЗаявки = Справочники.ТипыЗаказов.ZMP9Промо или 
							ТипЗаявки = Справочники.ТипыЗаказов.ZMP4ПрямаяПоставка Тогда
			ФормаДокумента.ТипЦен = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.PNCЗакупСкладская;
		КонецЕсли;
		ФормаДокумента.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументыРПартс.Параметры.УстановитьЗначениеПараметра("Заказ", Неопределено);
	ОстаткиРПартс.Параметры.УстановитьЗначениеПараметра("Заказ", Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиРПартсПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ЗаявкиРПартсПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиРПартсПриАктивизацииСтрокиОбработчикОжидания()
	
	Если ЗаявкиРПартсТекущаяСтрока <> Элементы.ЗаявкиРПартс.ТекущаяСтрока Тогда
		ОбновитьДанныеПоЗаявке();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоЗаявке()
	
	ТекущиеДанные = Элементы.ЗаявкиРПартс.ТекущаяСтрока;
	
	ДокументыРПартс.Параметры.УстановитьЗначениеПараметра("Заказ", ТекущиеДанные.ЗаказПокупателя);
	ОстаткиРПартс.Параметры.УстановитьЗначениеПараметра("Заказ", ТекущиеДанные.ЗаказПокупателя);
	
	Контрагент = ТекущиеДанные.Клиент.Контрагент;
	
	ЗаявкиРПартсТекущаяСтрока = ТекущиеДанные;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыРПартсВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьЗначение(Элемент.ТекущиеДанные.Документ);

КонецПроцедуры

&НаСервере
Функция ПолучитьФормуДокументаРПартс(ДокументСсылка)
	
	Форма = Неопределено;
	
    Возврат Форма;
	
КонецФункции


///////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ СТРАНИЦАМИ

&НаКлиенте
Процедура ЗакладкаРеноПартс(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРеноПартс;
КонецПроцедуры

&НаКлиенте
Процедура ЗакладкаСклад(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСклад;
КонецПроцедуры

&НаКлиенте
Процедура ЗакладкаРекламации(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРекламации;
КонецПроцедуры

&НаКлиенте
Процедура ЗакладкаЗаказЗапчастей(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗаказЗапчастей;
КонецПроцедуры

&НаКлиенте
Процедура ЗакладкаКаталог(Команда)
    Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаКаталог;
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ТАБЛИЦЫ РПартсЗаявки

&НаКлиенте
Процедура РПартсВвестиЗаказ(Команда)

	ТекСтрока = Элементы.ЗаявкиРПартс.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда

		Если РегистрыСведений.Renault_Промоакции.ЕстьПромоакции(
			ТекСтрока.Ссылка.Дата,
			ТекСтрока.Ссылка.Запчасти.ВыгрузитьКолонку("Номенклатура")) Тогда
			Если Вопрос("Для заказа есть активные промоакции, они корректно проставлены? Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекСтрока.Ссылка.ДилерскийЦентр) Тогда
			Предупреждение("Не заполенен дилерский центр");
			ФормаДЦ = ПолучитьФорму("Справочник.CRM_ДилерскиеЦентры.ФормаВыбора");
			ДЦСсылка = ФормаДЦ.Открытьмодально();
			Если ЗначениеЗаполнено(ДЦСсылка) Тогда
				УстаноыитьДЦВЗаявке(ДЦСсылка, ТекСтрока.Ссылка);
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		ФормаНовогоДокумента = ПолучитьФорму("Документ.ЗаказПокупателя.ФормаОбъекта");
		ВвестиЗаказНаСервере(ТекСтрока.Ссылка, ФормаНовогоДокумента.ДокументОбъект);
		ФормаНовогоДокумента.Открыть();

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РПартсВвестиЗамену(Команда)
	
	ТекСтрока = Элементы.ЗаявкиРПартс.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(ТекСтрока.ЗаказПокупателя) Тогда
			Предупреждение("На основании заявки не введен заказ покупателя");
			Возврат;
		КонецЕсли;
		
		Замена = ВвестиЗаменуНаСервере(ТекСтрока.ЗаказПокупателя);
		ФормаНовогоДокумента = ПолучитьФорму(
			"Документ.ЗаменаВЗаказеПокупателя.ФормаОбъекта",
				Новый Структура("Ключ", Замена));
		ФормаНовогоДокумента.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РПартсВвестиРеализацию(Команда)
	
	ТекСтрока = Элементы.ЗаявкиРПартс.ТекущиеДанные;

	Если ТекСтрока <> Неопределено Тогда

		Если Не ЗначениеЗаполнено(ТекСтрока.ЗаказПокупателя) Тогда
			Предупреждение("На основании заявки не введен заказ покупателя");
			Возврат;
		КонецЕсли;
		
		Реализация = ВвестиРеализациюНаСервере(ТекСтрока.ЗаказПокупателя);
		ФормаНовогоДокумента = ПолучитьФорму(
			"Документ.РеализацияТоваров.ФормаОбъекта",
				Новый Структура("Ключ", Реализация));
		ФормаНовогоДокумента.Открыть();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РПартсЗакрытьЗаявку(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
